package com.cmg.java.亿级流量架构书;

/**
 * Java亿级流量书 实例
 */
public class Info {

//    如何建设一个系统
//    长大是什么样子 方向
//
//    微服务+云原生架构
//            开发
//    限流
//            隔离
//    降级
//            重试
//
//    负载均衡与反向代理
//    负载均衡算法：round-robin、ip_hash、一致性哈希
//            动态负载均衡
//    Consul-template agent
//    upstream 列表
//
//    nginx
//            上游服务器
//    least_conn
//            least_time
//
//    隔离
//    线程隔离：
//    hystrix
//    请求解析--核心与非核心业务队列
//            进程隔离
//    读写隔离
//            集群机房
//    动静资源隔离
//            爬虫隔离
//    Ip+cookie 标记爬虫
//    热点隔离
//            资源隔离
//
//    降级
//    hystrix：失败降级 统计降级 超时重试
//
//            失败重试
//
//    健康检查
//
//            长连接
//
//    缓存
//
//            堆缓存
//    堆外缓存
//            磁盘缓存
//    分布式缓存
}
